/**
 * Created by r3bers on 25.02.2016.
 * Задания от Geekbrains
 * Написать программу, которая принимает строку и делает все слова заглавными:
 * “ЭТО настояшая пРоверка Букв” => “Это Настоящая Проверка Букв”
 */
public class Capitalizator {
    public static void main(String[] args) {
        String str = "ЭТО настояшая пРоверка Букв";
        System.out.println(str);
    }
}
